app/Controllers/MenuController.php

    public function tampil()
    {
        $data['data'] = $this->menus->findAll();
---
SELECT *
FROM `menu`

    public function create()
    {
        $data = array(
            'nama' => $this->request->getPost('nama'),
            'harga' => $this->request->getPost('harga'),
            'jumlah' => $this->request->getPost('jumlah'),
            'keterangan' => $this->request->getPost('keterangan'),
            'jenis' => $this->request->getPost('jenis'),
        );
        $this->menus->insert($data);
---
INSERT INTO `menu` (`nama`, `harga`, `jumlah`, `keterangan`, `jenis`) VALUES ('Nasi Goreng', '10000', '1', 'pedas', 'makanan')