app/Controllers/PesanController.php

    public function index()
    {
        $data['data'] = $this->menu->select('id, nama')->findAll();
---
SELECT `id`, `nama`
FROM `menu`