app/Controllers/UserController.php

SELECT *
FROM `user`
---
    public function tampil()
    {
        $data['data'] = $this->users->findAll();

INSERT INTO `user` (`nama`, `username`, `password`, `jeniskelamin`, `jenis`) VALUES ('Ratna', 'ratna', '$2y$10$PqhxD4RUtvxyPOYH9R4EM.iDpSLdJgMQ8pioDEYwFo5.0Z1/VCgU2', 'p', 'kasir')
---
    public function create()
    {
        $data = array(
            'nama' => $this->request->getPost('nama'),
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'),PASSWORD_DEFAULT),
            'jeniskelamin' => $this->request->getPost('jeniskelamin'),
            'jenis' => $this->request->getPost('jenis'),
        );
        $this->users->insert($data);